app/controllers/pages_controller.rb

  def profile
    #grab the username from the url as :id
    if (User.find_by_username(params[:id]))
      @username = params[:id]
    else
      #redirect to 404 page not found
      redirect_to root_path, :notice=> "User not found!"
    end

    @posts = Post.all.where("user_id=?", User.find_by_username(params[:id]).id)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "test1"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id=3) ORDER BY "posts"."created_at" DESC