app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "test"], ["user_id", 3], ["created_at", 2016-11-28 22:03:21 UTC], ["updated_at", 2016-11-28 22:03:21 UTC]]
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        respond_to do |f|
            if(@post.save)#logic for if post is saved successfully and "redirect"